[DeadGuy_Rioter_LWOTC X2SoldierClassTemplate]
DisplayName="暴徒"
ClassSummary="暴徒完全放弃了火器，但他们的手榴弹赋予了他们巨大的进攻力量。他们还备有一把战斗刀作为备选方案。"
LeftAbilityTreeTitle="投弹手"
RightAbilityTreeTitle="毁灭者"
+AbilityTreeTitles[0]="投弹手"
+AbilityTreeTitles[1]="毁灭者"
+AbilityTreeTitles[2]="闪电战"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNickNames[0]="Amp It Up"
RandomNickNames[1]="Bolt"
RandomNickNames[2]="Boomer"
RandomNickNames[3]="Bubblegum"
RandomNickNames[4]="Cable"
RandomNickNames[5]="Charcoal"
RandomNickNames[6]="Cooked Meat"
RandomNickNames[7]="Dr. Boom"
RandomNickNames[8]="Drive"
RandomNickNames[9]="Gears"
RandomNickNames[10]="Goggles"
RandomNickNames[11]="Grip"
RandomNickNames[12]="Gyro"
RandomNickNames[13]="High Voltage"
RandomNickNames[14]="Jigsaw"
RandomNickNames[15]="Murphy"
RandomNickNames[16]="No Hands"
RandomNickNames[17]="Powder"
RandomNickNames[18]="Pump"
RandomNickNames[19]="Ratchet"
RandomNickNames[20]="Smoke"
RandomNickNames[21]="System"
RandomNickNames[22]="Thunder"
RandomNickNames[23]="Torque"
RandomNickNames[24]="Wrench"

[DeadGuy_Operator_LWOTC X2SoldierClassTemplate]
DisplayName="操作人员"
ClassSummary="操作人员通过治疗、削弱目标，从远程支持他们的小队。"
LeftAbilityTreeTitle="医师"
RightAbilityTreeTitle="终结技"
+AbilityTreeTitles[0]="医师"
+AbilityTreeTitles[1]="终结技"
+AbilityTreeTitles[2]="干扰者"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNickNames[0]="Breaker"
RandomNickNames[1]="Circuit"
RandomNickNames[2]="Core Dump"
RandomNickNames[3]="Cyber"
RandomNickNames[4]="Cyborg"
RandomNickNames[5]="Griffon"
RandomNickNames[6]="Hammer"
RandomNickNames[7]="Harpy"
RandomNickNames[8]="Hydra"
RandomNickNames[9]="Iron"
RandomNickNames[10]="Manticore"
RandomNickNames[11]="Minotaur"
RandomNickNames[12]="Labyrinth"
RandomNickNames[13]="One More Try"
RandomNickNames[14]="Phoenix"
RandomNickNames[15]="Pied Piper"
RandomNickNames[16]="Redscreen"
RandomNickNames[17]="Rocket"
RandomNickNames[18]="Saber"
RandomNickNames[19]="Sphinx"
RandomNickNames[20]="Steel"
RandomNickNames[21]="The Accountant"
RandomNickNames[22]="Unicorn"
RandomNickNames_Male[0]="Orc"
RandomNickNames_Female[0]="Siren"

[DeadGuy_Patrol_LWOTC X2SoldierClassTemplate]
DisplayName="巡逻队"
ClassSummary="巡逻队在战争的迷雾中引路，积极击败出现的敌人并保持攻势。"
LeftAbilityTreeTitle="控制"
RightAbilityTreeTitle="中距离"
+AbilityTreeTitles[0]="控制"
+AbilityTreeTitles[1]="中距离"
+AbilityTreeTitles[2]="仇恨"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNickNames[0]="Archer"
RandomNickNames[1]="Bear"
RandomNickNames[2]="Cheetah"
RandomNickNames[3]="Chimera"
RandomNickNames[4]="Coyote"
RandomNickNames[5]="Double Edge"
RandomNickNames[6]="Hyena"
RandomNickNames[7]="Jackrabbit"
RandomNickNames[8]="Icepick"
RandomNickNames[9]="Leopard"
RandomNickNames[10]="Lightning"
RandomNickNames[11]="Raptor"
RandomNickNames[12]="Raven"
RandomNickNames[13]="Sleepy"
RandomNickNames[14]="The Mountain"
RandomNickNames[15]="Tiger"
RandomNickNames[16]="Two Birds"
RandomNickNames[17]="Voodoo"
RandomNickNames[18]="Weasel"
RandomNickNames[19]="Wolf"
RandomNickNames[20]="Wolverine"
RandomNickNames[21]="Yeti"
RandomNickNames_Female[0]="Black Widow"
RandomNickNames_Female[1]="Dryad"
RandomNickNames_Female[2]="Lioness"
RandomNickNames_Male[0]="Cougar"
RandomNickNames_Male[1]="Green Man"
RandomNickNames_Male[2]="Lion"
RandomNickNames_Male[3]="Sandman"

[DeadGuy_Marksman_LWOTC X2SoldierClassTemplate]
DisplayName="精准射手"
ClassSummary="精准射手的命中率极高，攻击力也很强。他们使用全息瞄准器，可以提升自己和团队对关键敌人的命中率。"
LeftAbilityTreeTitle="特殊效果"
RightAbilityTreeTitle="万无一失"
+AbilityTreeTitles[0]="特殊效果"
+AbilityTreeTitles[1]="万无一失"
+AbilityTreeTitles[2]="单发射击"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNickNames[0]="Ace"
RandomNickNames[1]="Barrel"
RandomNickNames[2]="Brass"
RandomNickNames[3]="Broadside"
RandomNickNames[4]="Cyclops"
RandomNickNames[5]="Eagle"
RandomNickNames[6]="Falcon"
RandomNickNames[7]="Gorgon"
RandomNickNames[8]="Hailstorm"
RandomNickNames[9]="Hawk"
RandomNickNames[10]="Ice"
RandomNickNames[11]="Joker"
RandomNickNames[12]="Lead"
RandomNickNames[13]="Not Again"
RandomNickNames[14]="Royal Flush"
RandomNickNames[15]="Santa"
RandomNickNames[16]="Storm"
RandomNickNames[17]="Tracer"
RandomNickNames[18]="Trey"
RandomNickNames[19]="Two Hands"
RandomNickNames[20]="Vampire"
RandomNickNames[21]="Warlord"
RandomNickNames[22]="Zero"
RandomNickNames_Female[0]="Baroness"
RandomNickNames_Female[1]="Kitty"
RandomNickNames_Female[2]="Queen"
RandomNickNames_Male[0]="Baron"
RandomNickNames_Male[1]="King"
RandomNickNames_Male[2]="Snowman"

[DeadGuy_Bandit_LWOTC X2SoldierClassTemplate]
DisplayName="强盗"
ClassSummary="强盗们一直藏身于阴影中，直到合适的时机，然后以爆炸性的力量惊吓敌人。"
LeftAbilityTreeTitle="渗透者"
RightAbilityTreeTitle="伏击火力"
+AbilityTreeTitles[0]="渗透者"
+AbilityTreeTitles[1]="伏击火力"
+AbilityTreeTitles[2]="炮兵"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNicknames[0]="Bison"
RandomNicknames[1]="Broken Glass"
RandomNicknames[2]="Christmas"
RandomNicknames[3]="Claws"
RandomNicknames[4]="Cudgel"
RandomNicknames[5]="Dino"
RandomNicknames[6]="Dump Truck"
RandomNicknames[7]="Edge"
RandomNicknames[8]="Feet"
RandomNicknames[9]="Fruit"
RandomNicknames[10]="Jellybean"
RandomNicknames[11]="Junior"
RandomNicknames[12]="Knuckles"
RandomNicknames[13]="Little"
RandomNicknames[14]="Nosey"
RandomNicknames[15]="One Way"
RandomNicknames[16]="Ox"
RandomNicknames[17]="Peanut"
RandomNicknames[18]="Scar"
RandomNicknames[19]="Skin"
RandomNicknames[20]="Stiletto"
RandomNicknames[21]="Teeth"
RandomNicknames[22]="The Brute"
RandomNicknames[23]="Thirteen"
RandomNickNames_Male[0]="Mr. Mean"
RandomNickNames_Male[1]="Mutt"
RandomNickNames_Male[2]="Old Man"
RandomNickNames_Female[0]="Cat"
RandomNickNames_Female[1]="Mrs. Mean"
RandomNickNames_Female[3]="Old Woman"

[DeadGuy_Vigilante_LWOTC X2SoldierClassTemplate]
DisplayName="民兵"
ClassSummary="民兵用枪和刀惩戒对手。他们的耐久性和机动性可以帮助他们摆脱困境。"
LeftAbilityTreeTitle="Invulnerable"
RightAbilityTreeTitle="Speedster"
+AbilityTreeTitles[0]="Invulnerable"
+AbilityTreeTitles[1]="Speedster"
+AbilityTreeTitles[2]="Avenger"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNicknames[0]="Baseball"
RandomNicknames[1]="Beans"
RandomNicknames[2]="Brick"
RandomNicknames[3]="Burnout"
RandomNicknames[4]="Butterfly"
RandomNicknames[5]="Cape"
RandomNicknames[6]="Cardboard Box"
RandomNicknames[7]="Cube"
RandomNicknames[8]="Hailstorm"
RandomNicknames[9]="Heavy"
RandomNicknames[10]="Hero"
RandomNicknames[11]="Lemur"
RandomNicknames[12]="Little"
RandomNicknames[13]="Mammoth"
RandomNicknames[14]="Matchstick"
RandomNicknames[15]="Mountain"
RandomNicknames[16]="No Brakes"
RandomNicknames[17]="Petrol"
RandomNicknames[18]="Plutonium"
RandomNicknames[19]="Shell"
RandomNicknames[20]="Silly"
RandomNicknames[21]="Slab"
RandomNicknames[22]="Suspenders"
RandomNicknames[23]="Terror"
RandomNicknames[24]="Tower"
RandomNicknames[25]="Train"
RandomNickNames_Male[0]="Jack"
RandomNickNames_Female[0]="Jill"

[DeadGuy_Striker_LWOTC X2SoldierClassTemplate]
DisplayName="打击者"
ClassSummary="没有狙击视野的打击者使用狙击步枪可能会让他们显得有些笨拙，但只要稍作设置，他们就能造成巨大的伤害。"
LeftAbilityTreeTitle="后场线"
RightAbilityTreeTitle="下套"
+AbilityTreeTitles[0]="后场线"
+AbilityTreeTitles[1]="下套"
+AbilityTreeTitles[2]="赌徒"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNicknames[0]="Aspen"
RandomNicknames[1]="Birch"
RandomNicknames[2]="Cedar"
RandomNicknames[3]="Chupacabra"
RandomNicknames[4]="Dark"
RandomNicknames[5]="Flint"
RandomNicknames[6]="Garbage"
RandomNicknames[7]="Kudzu"
RandomNicknames[8]="Long"
RandomNicknames[9]="Meat"
RandomNicknames[10]="Mossy"
RandomNicknames[11]="Muskrat"
RandomNicknames[12]="Pine"
RandomNicknames[13]="Pond"
RandomNicknames[14]="Powder"
RandomNicknames[15]="Ring"
RandomNicknames[16]="Robber"
RandomNicknames[17]="Sandwich"
RandomNicknames[18]="Sasquach"
RandomNicknames[19]="Slate"
RandomNicknames[20]="Snare"
RandomNicknames[21]="Steak"
RandomNicknames[22]="Stinky"
RandomNicknames[23]="Tanner"
RandomNicknames[24]="Tire"
RandomNicknames[25]="Walker"
RandomNicknames[26]="Werewolf"
RandomNicknames[27]="Whiskey"
RandomNicknames[28]="Yeti"
RandomNickNames_Male[0]="Buffalo Bill"
RandomNickNames_Male[1]="Dusk"
RandomNickNames_Female[0]="Dawn"
RandomNickNames_Female[1]="Pearl"

[DeadGuy_Paladin_LWOTC X2SoldierClassTemplate]
DisplayName="圣骑士"
ClassSummary="圣骑士已经成功唤醒了低级的灵能能力。这种力量可以安全地用于提升移动性或支援队友，但是将其用于破坏则会非常危险。"
LeftAbilityTreeTitle="可耻"
RightAbilityTreeTitle="喋血"
+AbilityTreeTitles[0]="可耻"
+AbilityTreeTitles[1]="喋血"
+AbilityTreeTitles[2]="牧师"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNicknames[0]="Balcony"
RandomNicknames[1]="Bishop"
RandomNicknames[2]="Breakneck"
RandomNicknames[3]="Cola"
RandomNicknames[4]="Glass"
RandomNicknames[5]="Jammer"
RandomNicknames[6]="Magic"
RandomNicknames[7]="Marbles"
RandomNicknames[8]="Master"
RandomNicknames[9]="One"
RandomNicknames[10]="Radar"
RandomNicknames[11]="Rogue"
RandomNicknames[12]="Sad"
RandomNicknames[13]="Sewer"
RandomNicknames[14]="Shuffle"
RandomNicknames[15]="Silver"
RandomNicknames[16]="Slick"
RandomNicknames[17]="Sonic"
RandomNicknames[18]="Stairs"
RandomNicknames[19]="Straw"
RandomNicknames[20]="Toucan"
RandomNicknames[21]="Upstairs"
RandomNicknames[22]="Wasp"
RandomNicknames[23]="Whisper"
RandomNickNames_Male[0]="Batman"
RandomNickNames_Male[1]="Mad Hatter"
RandomNickNames_Female[0]="Alice"
RandomNickNames_Female[1]="Catwoman"

[DeadGuy_Artillery_LWOTC X2SoldierClassTemplate]
DisplayName="炮兵"
ClassSummary="在炮兵的训练中，枪械训练最少，但他们擅长使用榴弹。他们还携带防弹盾牌来保护自己和附近的队友。"
LeftAbilityTreeTitle="掷弹兵"
RightAbilityTreeTitle="毁灭者"
+AbilityTreeTitles[0]="掷弹兵"
+AbilityTreeTitles[1]="毁灭者"
+AbilityTreeTitles[2]="闪电战"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"
RandomNickNames[0]="Amp It Up"
RandomNickNames[1]="Bolt"
RandomNickNames[2]="Boomer"
RandomNickNames[3]="Bubblegum"
RandomNickNames[4]="Cable"
RandomNickNames[5]="Charcoal"
RandomNickNames[6]="Cooked Meat"
RandomNickNames[7]="Dr. Boom"
RandomNickNames[8]="Drive"
RandomNickNames[9]="Gears"
RandomNickNames[10]="Goggles"
RandomNickNames[11]="Grip"
RandomNickNames[12]="Gyro"
RandomNickNames[13]="High Voltage"
RandomNickNames[14]="Jigsaw"
RandomNickNames[15]="Murphy"
RandomNickNames[16]="No Hands"
RandomNickNames[17]="Powder"
RandomNickNames[18]="Pump"
RandomNickNames[19]="Ratchet"
RandomNickNames[20]="Smoke"
RandomNickNames[21]="System"
RandomNickNames[22]="Thunder"
RandomNickNames[23]="Torque"
RandomNickNames[24]="Wrench"